import { SaudiWordsData } from './../interfaces/saudi-words-data';
import { CallsData } from './../interfaces/calls-data';


export const callsTableData:CallsData [] = [
    {
        notUse:'حضرتك-فندم',
        use:'استاذي / اختي'
    },


    {
        notUse:'دلوقتي',
        use:'الحين-الان'
    },

    {
        notUse:'حاضر',
        use:'ابشر'
    },

    {
        notUse:'عايزك تعمل....',
        use:'ابغاك...../ممكن تعمل..'
    },

    {
        notUse:'ايه',
        use:'عفوا'
    },

    {
        notUse:'خليك معايا',
        use:'ممكن تنتظر معي لحظات'
    },

    {
        notUse:'اتصلت بينا بخصوص',
        use:'كنت متواصل معانا بخصوص'
    },

    {
        notUse:'رقم الموبيل',
        use:'رقم الجوال'
    },

    {
        notUse:'المحل',
        use:'المتجر'
    },

    {
        notUse:'ازاي',
        use:'كيف؟'
    },

    {
        notUse:'ماينفعش',
        use:'مايصلح- مايصير'
    },


    {
        notUse:'بئولك',
        use:'ببلغك'
    },


    {
        notUse:'هديك رقم العميل',
        use:'بعطيك رقم العميل'
    },

    {
        notUse:'ممكن تبعتلنا صورة الفاتورة',
        use:'ممكن ترسل صورة الفاتورة'
    },
]


export const callsNotes:string[] = [
    'نحاول بقدر الامكان مانخلطش بين اللهجه السعوديه والشاميه ومانستخدمش هيك ، هاد-شو؟',
    
    'نحاول نلتزم بمخارج الحروف زي كلمة هذا ما نقولش هازا',
    
    'لو هتكلم مندوب تسأله عن طلب هتسأله بالطريقه دي بخصوص الطلب اللي معك وين وصلت ، او وين موقعك الان ،او رحت للمتجر ،او وصلت لموقع العميل ولا باقي',
    
    `في حاله وضع العميل علي الانتظار 
    لا يتم وضع العميل علي الانتظار نهائيا الا بموافقه العميل وتكون كلأتي 
    بعتذر ليك  استاذي بستأذنك لحظات معايه علي الانتظار لحل مشكلتك 
     رجاء  ما تقفل المكالمه برجع  اليك الان `,

     `عند العوده 
     شكرا اليك استاذي واعتذرلك علي الاطاله
      مع وجود الحل وعدم طلب منه الاستفسار مره اخري الا في شيئ جديد`,

      `عدم السؤال على رقم جوال المتصل الا اذا تم التأكد من الداشبورد اولا انه لا يوجد حساب برقم الجوال الظاهر على الجنيسيس`,

      'تجنب وضع الميوت حتي لا يتم اغلاق المكالمه من قبل العميل',
      
      'عدم رفع صوتك علي صوت العميل او المندوب',

      'عدم التحدث بصوره لا تليق بممثل خدمه العملاء',

      'عدم تناول اي مأكولات وقت المكالمه',

      'عدم التحدث مع زميلي وقت المكالمه',

      `عدم اعطاء المكالمه لشخص اخر او تحويل المكالمه  لحل مشكله
      دون التوضيح اهميه هذا الشخص للمندوب
       او العميل ويتم التوضيح ان هذا الشخص ايضا مختص لحل مشكلتك`,


       `في حاله انه لدي المندوب او العميل اي استفسارت اخري  وتم حلها يتم انهاء المكالمه بجمله 
       الرجاء عدم التردد فً التواصل معنا اذا كان عندك اي استفسارات اخرى`,

       `لو كان- مندوب شكرا لوجودك معنا في تطبيق شقردي لديك استفسار اخر نعم 
       تفضل استاذي عطني استفسارك . ومع نهايه المكالمه موفق ان شاء الله بالطلبات القادمة`,


       `كيف بنهي المكالمه ؟
       لقد تم حل مشكله .................. وتقدر الان تستخدم التطبيق بصوره ممتازه `,


       `لو كان - عميل شكرا لأختيارك  تطبيق شقردي لديك اي استفسار اخر ؟ 
       موفق ان شاء الله بالطلبات القادمة`,




] 


export const angryCustomerNotes:string[] = [
    ' الاستماع الجيد للعمبل او المندوب',
    
    'عدم المقاطعه نهائيا وتتم المقاطعه في حاله سكوت المندوب او العميل',

    'اعطاء كلمات بها تعاطف و تعطي اهتمام بمشكله المندوب او العمل مثل ؟',

    'اعتذر عن ما بدر من المندوب نعتذر عن ما بدر من العميل',

    'ابشر بلخير ما يرضينا ان يحدث هذا سنرفع اليك شكوي ونحل الامر في اسرع وقت ',

    'يهمنا ملاحظاتك ووقتك الذي تطلب فيه الطلب نحن فخورين بجود مندوب مثلك معنا ',

    'نحن سعداء بوجود عميل مثلك معنا ونسعي لحل مشكلتك'
]

export const saudiAngruCustomerWords:string[] = [
    'ابشر باللً تبٌيه ان شاء الله  فً اسرع وقت',
    'انا مقدرالموقف واعتذرلك جدا',
    'اشكرك على صبرك وتعاونك',
    'احنا فً خدمتكم',
    'خدمتك مهمتنا',
    'انت من العمالء المتميزين عندنا',
    'ما قصرت, ٌيعطٌك العافٌة',
    'ان شاء الله  نكون عند حسن ظنك'
]


export const saudiWordsTableData:SaudiWordsData [] = [
    {
        word:'اذا ماعلٌيك أمر',
        reply:'ابشر'
    },

    {
        word:'يعطيك العافيه',
        reply:'الله يعافيك – واياك'
    },

    {
        word:'مساك الله  بالخيٌر',
        reply:' مساك الله  بالنور'
    },

    {
        word:'كل عام وانتم بخٌير',
        reply:'وانت بخٌير / ينعاد علٌكم بالصحة والعافٌة'
    },

    {
        word:'اهلا وسهلا',
        reply:' اهلٌن فيٌك عزٌزي'
    },


    {
        word:'الله لا يهينك',
        reply:' ابشر باللًي تبٌه'
    },


    {
        word:'حٌياك الله',
        reply:'الله يحيك'
    },


    {
        word:'عميل هندي يقول مافي معلوم',
        reply:' يعني مافي فلوس'
    },


    {
        word:'بنايه',
        reply:'منزل'
    },


    {
        word:'دوام',
        reply:'عمل'
    },
]