import { Orderstypes } from './../interfaces/orderstypes';

export const courierData:Orderstypes[] = [
    {
        case:'في حاله تواصل المندوب معانا لتغير الصوره الشخصيه',
        action:'نقوم بابلاغه بالتواصل معانا علي الدعم المباشرو ارسال الصوره المراد تغيرها '
    },
    {
        case:'في حاله وجود مشكله في عدم استقبال الطلب ',
        action:'برجاء ابلاغ المندوب بالتواجد في النقاط الحمراء علي الخريطه  المناطق الحيويه و الاسواق و نقوم باعاده تنشيط الحساب '
    },

    {
        case:'في حاله وجود مشكله في الحساب البنكي',
        action:'برجاء التاكد ان الحساب البنكي يكون حساب بنك اهلي و ان رقم الحساب اخر 14 رقم من رقم iban , ورقم iban يبدا ب SA و يكون 22 رقم '
    },


    {
        case:'في حاله تواصل المندوب معانا لتغير رقم الجوال او بيانات الحساب ',
        action:' نقوم بابلاغه بعدم امكانيه تغير بيانات الحساب الشخصي الحالي '
    }
];