import { Multitabledata } from '../interfaces/multitabledata';
import { Tabledata } from './../interfaces/tabledata';

export const cashData: Tabledata[] = [
  {
    case: 'المندوب تواصل معانا ووضح انه دفع قيمة الطلب في المتجر واستلم كاش من العميل',
    actions: [
      'التاكد من الفاتورة ( اسم المطعم - وقت الطلب - الاغراض وقيمة الفاتورة',
      'التاكد من توصيل الطلب علي الخريطة',
      'تحويل الطلب الي كاش واستكماله',
    ],
  },

  {
    case: 'المندوب تواصل معانا ووضح انه دفع قيمة الطلب في المتجر لكن ليس معه فاتورة واستلم كاش من العميل',
    actions: [
      'oUT CALL للمطعم للتاكد ان المندوب دفع قيمة الطلب في المطعم',
      'التاكد من توصيل الطلب علي الخريطة',
      'تحويل الطلب الي كاش واستكماله',
    ],
  },

  {
    case: 'المندوب تواصل معانا ووضح انه لم يدفع قيمة الطلب في المتجر واستلم كاش من العميل',
    actions: [
      ' التاكد من توصيل الطلب علي الخريطة',
      'CHANGE TO CASH رفع الطلب في شيت الكاش في ملف',
      'عمل بلوك لمحفظة المندوب تحويل الطلب الي كاش',
    ],
  },

  {
    case: 'العميل تواصل معانا ووضح انه دفع كاش للمندوب مع عدم وجود فاتورة في الدردشة ',
    actions: [
      'التواصل مع المندوب لاخباره بشحن قيمة الطلب لخصمه منه ',
      'CHANGE TO CASH رفع الطلب في شيت الكاش في ملف',
      'عمل بلوك لمحفظة المندوب تحويل الطلب الي كاش',
    ],
  },

  {
    case: 'العميل تواصل معانا ووضح انه دفع كاش للمندوب مع وجود فاتورة في الدردشة ',
    actions: [
      'التاكد من الفاتورة ( اسم المطعم - وقت وتاريخ الفاتورة  - الاغراض وقيمة الفاتورة- طريقة الدفع في الفاتورة )',
      'تحويل الطلب الي كاش واستكماله',
    ],
  },
];

export const cancelledOnline: Multitabledata[] = [
  {
    case: 'العميل تواصل معانا ووضح انه يريد الغاء الطلب',
    action: 'OUT CALL للمطعم للتاكد من عدم تسليم الطلب للمندوب ثم الغاء الطلب',
  },

  {
    case: 'المندوب تواصل معانا لالغاء الطلب والمطعم ماكد تسليم الطلب والمندوب (وصل او لم يصل) للمطعم علي الخريطة',
    action: 'OUT CALL للمطعم للتاكد من عدم تسليم الطلب للمندوب ثم الغاء الطلب',
  },

  {
    case: ' المندوب تواصل معانا لالغاء الطلب والمطعم غير ماكد تسليم الطلب والمندوب لم يصل للمطعم علي الخريطة',
    action: 'الغاء الطلب',
  },

  {
    case: 'المندوب يريد الالغاء لان المتجر مغلق',
    action:
      'نطلب منه ارسال صورة للمتجر المغلق والتاكد من اسم المطعم ثم الغاء الطلب',
  },

  {
    case: 'المندوب يريد الالغاء لان الاغراض غير متوفرة ( الدردشة توضح ذلك )',
    action: 'الغاء الطلب',
  },

  {
    case: 'المندوب يريد الالغاء لان الاغراض غير متوفرة ( الدردشة توضح ذلك )',
    action: 'OUT CALL للمطعم للتاكد من عدم تسليم الطلب للمندوب ثم الغاء الطلب',
  },

  {
    case: 'المندوب وضح ان العميل لايتجاوب معه لاستلام الطلب ( المندوب ماكد علي العميل الطلب في الدردشة )',
    action: 'الغاء الطلب ورفع طلب تعويض للمطعم',
  },

  {
    case: 'المندوب وضح ان العميل لايتجاوب معه لاستلام الطلب ( المندوب ماكد علي العميل الطلب في الدردشة )',
    action:
      'الغاء الطلب ورفعه في شيت الكاش لخصم قيمة الطلب من المندوب وتحويلها للمطعم وعمل بلوك للمحفظة',
  },

  {
    case: '- المندوب وضح ان العميل لم يتجاوب معه لتاكيد الطلب ( المندوب لم يصل علي الخريطة )',
    action: 'الغاء الطلب',
  },

  {
    case: 'المندوب وضح ان العميل لم يتجاوب معه لتاكيد الطلب ( المندوب وصل علي الخريطة )',
    action: 'OUT CALL للمطعم للتاكد من عدم تسليم الطلب للمندوب ثم الغاء الطلب',
  },

  {
    case: 'المندوب احضر الاغراض من مطعم اخر',
    action: 'الغاء الطلب',
  },
];

export const cancelledOffline: Multitabledata[] = [
  {
    case: 'المتجر مغلق',
    action:
      'نطلب منه ارسال صورة للمتجر المغلق والتاكد من اسم المطعم ثم الغاء الطلب',
  },


  {
    case: 'الاغراض غير متوفرة',
    action: 'الغاء الطلب',
  },


  {
    case: 'العميل يريد الالغاء',
    action:
      'التاكد من ان المندوب لم يستلم الطلب او التاكد من خلال الدردشة ان المندوب موافق علي الالغاء ثم الغاء الطلب',
  },

  
  {
    case: 'المندوب وضح ان العميل رفض استلام الطلب ( المندوب غير ماكد علي العميل في الدردشة )',
    action: 'الغاء الطلب وعدم رفع طلب تعويض للمندوب',
  },

  {
    case: 'المندوب وضح ان العميل رفض استلام الطلب ( المندوب ماكد علي العميل في الدردشة )',
    action: 'الغاء الطلب و رفع طلب تعويض للمندوب',
  },

  {
    case: 'المندوب احضر الاغراض من مطعم اخر',
    action: 'الغاء الطلب',
  },
];

export const courierOnline: Tabledata[] = [
  {
    case: 'المندوب يريد الغاء الطلب لانه لا يتستطيع توصيله لاي سبب ( المندوب لم يصل المطعم علي الخريطة )',
    actions: ['تغير المندوب', 'التواصل مع العميل لاخباره بتغير المندوب'],
  },

  {
    case: ' المندوب يريد الغاء الطلب لانه لا يتستطيع توصيله لاي سبب ( المندوب وصل المطعم علي الخريطة )',
    actions: [
      'OUT CALL للمطعم للتاكد من عدم تسليم الطلب',
      'تغير المندوب',
      'التواصل مع العميل لاخباره بتغير المندوب',
    ],
  },
];

export const courierOffline: Tabledata[] = [
  {
    case: 'المندوب يريد الغاء الطلب لانه لا يتستطيع توصيله لاي سبب',
    actions: ['تغير المندوب', 'التواصل مع العميل لاخباره بتغير المندوب'],
  },
];
