import { Orderstypes } from './../interfaces/orderstypes';

export const cashData:Orderstypes[] = [
    {
        role:'مندوب',
        case:'في حاله تواصل المندوب معانا و بلغنا انه استلم كاش من العميل',
        action:'بيتم التحويل الطلب لكاش'
    },
    {
        role:'عميل',
        case:'في حاله تواصل العميل و بلغنا انه دفع الطلب كاش',
        action:'بيتم التواصل مع المندوب من خلال out call للتاكد من ان المندوب استلم المبلغ من العميل وتحويل الطلب ال cash واستكماله'
    }
];


export const cancelledData:Orderstypes[] = [
    {
        role:'مندوب',
        case:'المحل مغلق',
        action:'يجب ابلاغ العميل  في الدردشه الخاصه بالتطبيق و تصوير المحل حتي يتم اغلاقه '
    },

    {
        role:'مندوب',
        case:'العميل يريد الغاء الطلب ',
        action:'يجب ان يكون ظاهر في الدردشه انه تم الاتفاق علي اغلاق الطلب حتي يتم اغلاقه '
    },

    {
        role:'مندوب',
        case:'العميل لايستجيب',
        action:'يتم محاوله التواصل مع العميل و اذا لم يتم الرد يتم الغاء الطلب '
    },

    {
        role:'عميل',
        case:'العميل يريد الغاء الطلب ',
        action:'في حاله ان المندوب بعيد عن المكان و لم يقوم بارفاق فاتوره يتم الغاء الطلب مباشرة '
    },

    {
        role:'عميل',
        case:'العميل يريد الغاء الطلب',
        action:'يجب ابلاغ العميل  في الدردشه الخاصه بالتطبيق و تصوير المحل حتي يتم اغلاقه '
    },
]


export const completedData:Orderstypes[] = [
    {
        role:'مندوب',
        case:'المندوب عايز يستكمل الطلب والطلب نوعه كاش ',
        action:'يتم مراجعة الخريطة والدردشة واذا تبين انه وصل الطلب . يتم استكمال الطلب '
    },

    {
        role:'مندوب',
        case:'المندوب عايز يستكمل الطلب والطلب نوعه online والعميل ماكد دفع ',
        action: 'out call للعميل للتاكد من استلام الطلب وتوجيه لاستكمال الطلب '
    },

    {
        role:'مندوب',
        case:'المندوب عايز يستكمل الطلب والطلب نوعه online والعميل لم ياكد دفع',
        action: 'توجيه المندوب للتواصل مع العميل لتاكيد دفع .. اذا كان العميل رافض دفع والمندوب سلم الطلب للعميل نقوم بالغاء الطلب وعدم رفع طلب تعويض له اذا لم يسلمه الطلب نطلب منه تصوير الاغراض في الدردشة ثم نرفع له طلب تعويض له بقيمة الاغراض '
    }
]


export const courierData:Orderstypes[] = [
    {
        role:'مندوب',
        case:'المندوب يحصل له ظرف',
        action:'بيتم تغير المندوب '
    },
    {
        role:'العميل',
        case:'العميل يرد تغير المندوب لاي سبب',
        action: 'يجب التاكد من ان المندوب لم يقوم بشراء الاغراض او ارفاق فاتوره قبل تغير المندوب'
    }
]